docs/math/group/cfsg.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-02-14 Mon 12:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Classification of Finite Simple Groups</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Classification of Finite Simple Groups</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-503293b3-12c9-4e7e-a9ad-e3f0089ec368">1. Overview</a></li>
<li><a href="#h-29bf0074-0324-4028-8386-65a5cf94e149">2. References</a>
<ul>
<li><a href="#h-919f32fe-ad5e-4f78-ac8d-2e90381410e7">2.1. Second Generation Proof</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-503293b3-12c9-4e7e-a9ad-e3f0089ec368" class="outline-2">
<h2 id="h-503293b3-12c9-4e7e-a9ad-e3f0089ec368"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-h-503293b3-12c9-4e7e-a9ad-e3f0089ec368">
<p>
This is usually given as the world record for longest proof. The first
proof took around 15000 pages in over a decade of journal articles. The
second generation proof (by Gorenstein, Lyons, and Solomon) is still in progress, and should take around
7000 pages. Although daunting, it involves extraordinarily beautiful
mathematics.
</p>

<p>
Aschbacher, in his article <a href="https://www.ams.org/notices/200407/fea-aschbacher.pdf">"The Status of the Classification of the Finite Simple Groups"</a> 
(2004) has called the work on the classification problem by
<a href="https://users.math.msu.edu/users/meierfra/">Ulrich Meierfrankenfeld</a>, Bernd Stellmacher, Gernot Stroth, and a few
others, a third generation program using the amalgam method as the main
tool. This works appears to be <a href="https://www2.mathematik.uni-halle.de/stroth/class.html">on Stroth's website</a> and continued on
<a href="https://users.math.msu.edu/users/meierfra/Preprints/CGP/cgp_abstract.html">Meierfrankenfeld's site</a> (See also <a href="https://arxiv.org/abs/1906.07216">arXiv:1906.07216</a>.)
</p>
</div>
</div>


<div id="outline-container-h-29bf0074-0324-4028-8386-65a5cf94e149" class="outline-2">
<h2 id="h-29bf0074-0324-4028-8386-65a5cf94e149"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-h-29bf0074-0324-4028-8386-65a5cf94e149">
</div>

<div id="outline-container-h-919f32fe-ad5e-4f78-ac8d-2e90381410e7" class="outline-3">
<h3 id="h-919f32fe-ad5e-4f78-ac8d-2e90381410e7"><span class="section-number-3">2.1</span> Second Generation Proof</h3>
<div class="outline-text-3" id="text-h-919f32fe-ad5e-4f78-ac8d-2e90381410e7">
<p>
This is a series of books published by AMS.
</p>

<ul class="org-ul">
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups</i>.<br>
Mathematical Surveys and Monographs, vol. 40, Providence, R.I.:
American Mathematical Society, 1994.</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups, Number 2</i>.<br>
Mathematical Surveys and Monographs, vol. 40, Providence, R.I.:
American Mathematical Society, 1996.</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups, Number 3</i>.<br>
Mathematical Surveys and Monographs, vol. 40, Providence, R.I.:
American Mathematical Society, 1998.</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups, Number 4. Part II, Chapters 1-4: Uniqueness Theorems</i>.<br>
Mathematical Surveys and
Monographs, vol. 40, Providence, R.I.: American Mathematical Society, 1999.</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups, Number 5</i>.<br>
Mathematical Surveys and Monographs, vol. 40, Providence, R.I.:
American Mathematical Society, 2002.</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups, Number 6: Part IV: The Special Odd Case</i>.<br>
Mathematical Surveys and Monographs, vol. 40,
Providence, R.I.: American Mathematical Society, 2005.</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The classification of the finite simple groups, Number 7: Part III, Chapters 7–11: The Generic Case, Stages 3b and 4a</i>.<br>
Mathematical Surveys and Monographs, vol. 40, Providence, R.I.: American
Mathematical Society, 2018</li>
<li>Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The Classification of the Finite Simple Groups, Number 8: Part III, Chapters 12–17: The Generic Case, Completed</i>.<br>
Mathematical Surveys and
Monographs, vol. 40, Providence, R.I.: American Mathematical Society, 2018.</li>
<li>Inna Capdeboscq and Daniel Gorenstein and Richard Lyons and Ronald Solomon,<br>
<i>The Classification of the Finite Simple Groups, Number 9: Part V, Chapters 1-8: Theorem \(C_{5}\) and Theorem \(C_{6}\), Stage 1</i>.
Mathematical Surveys and Monographs, vol. 40, Providence, R.I.: American
Mathematical Society, 2021</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-02-14 Mon 12:49.</p>
</div>
</body>
</html>